import random


def start():
    days = {
        '01': 'первое',
        '02': 'второе',
        '03': 'третье',
        '04': 'четвертое',
        '05': 'пятое',
        '06': 'шестое',
        '07': 'седьмое',
        '08': 'восьмое',
        '09': 'девятое',
        '10': 'десятое',
        '11': 'одиннадцатое',
        '12': 'двенадцатое',
        '13': 'тринадцатое',
        '14': 'четырнадцатое',
        '15': 'пятнадцатое',
        '16': 'шестнадцатое',
        '17': 'семнадцатое',
        '18': 'восемнадцатое',
        '19': 'деаятнадцатое',
        '20': 'двадцатое',
        '21': 'двадцать первое',
        '22': 'двадцать второе',
        '23': 'двадцать третье',
        '24': 'двадцать четвертое',
        '25': 'двадцать пятое',
        '26': 'двадцать шестое',
        '27': 'двадцать седьмое',
        '28': 'двадцать восьмое',
        '29': 'двадцать девятое',
        '30': 'тридцатое',
        '31': 'тридцать первое'
    }

    months = {
        '01': 'января',
        '02': 'февраля',
        '03': 'марта',
        '04': 'апреля',
        '05': 'мая',
        '06': 'июня',
        '07': 'июля',
        '08': 'августа',
        '09': 'сентября',
        '10': 'октября',
        '11': 'ноября',
        '12': 'декабря',
    }

    questions = [
        {
            'text': 'Введите дату рождения Исаака Ньютона: ',
            'value': '04.01.1643'
        },
        {
            'text': 'Введите дату рождения Билла Гейста: ',
            'value': '28.10.1955'
        },
        {
            'text': 'Введите дату рождения Альберта Энштейна: ',
            'value': '14.03.1879'
        },
        {
            'text': 'Введите дату рождения Николы Тесла: ',
            'value': '10.07.1856'
        },
        {
            'text': 'Введите дату рождения Томаса Эдисона: ',
            'value': '11.02.1847'
        },
        {
            'text': 'Введите дату рождения Сергея Брин: ',
            'value': '21.08.1973'
        },
        {
            'text': 'Введите дату рождения Стива Джобса: ',
            'value': '24.02.1955'
        },
        {
            'text': 'Введите дату рождения Дмитрия Менделеева: ',
            'value': '08.02.1834'
        },
        {
            'text': 'Введите дату рождения Майкла Фарадея: ',
            'value': '22.09.1791'
        },
        {
            'text': 'Введите дату рождения Джона Томсона: ',
            'value': '18.12.1856'
        },
    ]

    while True:
        count_question = 5
        random_requestions = random.sample(questions, count_question)
        correct_answer = 0

        for question in random_requestions:
            answer = input(question['text'])
            if answer == question['value']:
                correct_answer += 1
                print('Верно')
            else:
                date = question['value'].split('.')
                print(f'{days[date[0]]} {months[date[1]]} {date[2]} года')

        print(f'Количество правильных ответов {correct_answer}')
        print(f'Количество неправильных ответов {count_question - correct_answer}')

        repeat = input(
            'Начать игру сначала? (Для повтора игры введите - Y, для окончания игры - любой другой символ): ')
        if repeat != 'Y' and repeat != 'y':
            break
        print('\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n')
